xml/PTZBinding.SetConfiguration.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:tdn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <tptz:SetConfiguration>
    <tptz:PTZConfiguration token="" MoveRamp="0" PresetRamp="0" PresetTourRamp="0">
     <tt:Name></tt:Name>
     <tt:UseCount>0</tt:UseCount>
     <tt:NodeToken></tt:NodeToken>
     <tt:DefaultAbsolutePantTiltPositionSpace>http://www.example.com/schema/anyURI</tt:DefaultAbsolutePantTiltPositionSpace>
     <tt:DefaultAbsoluteZoomPositionSpace>http://www.example.com/schema/anyURI</tt:DefaultAbsoluteZoomPositionSpace>
     <tt:DefaultRelativePanTiltTranslationSpace>http://www.example.com/schema/anyURI</tt:DefaultRelativePanTiltTranslationSpace>
     <tt:DefaultRelativeZoomTranslationSpace>http://www.example.com/schema/anyURI</tt:DefaultRelativeZoomTranslationSpace>
     <tt:DefaultContinuousPanTiltVelocitySpace>http://www.example.com/schema/anyURI</tt:DefaultContinuousPanTiltVelocitySpace>
     <tt:DefaultContinuousZoomVelocitySpace>http://www.example.com/schema/anyURI</tt:DefaultContinuousZoomVelocitySpace>
     <tt:DefaultPTZSpeed>
      <tt:PanTilt x="0.0" y="0.0" space="http://www.example.com/schema/anyURI">
      </tt:PanTilt>
      <tt:Zoom x="0.0" space="http://www.example.com/schema/anyURI">
      </tt:Zoom>
     </tt:DefaultPTZSpeed>
     <tt:DefaultPTZTimeout>PT0S</tt:DefaultPTZTimeout>
     <tt:PanTiltLimits>
      <tt:Range>
       <tt:URI>http://www.example.com/schema/anyURI</tt:URI>
       <tt:XRange>
        <tt:Min>0.0</tt:Min>
        <tt:Max>0.0</tt:Max>
       </tt:XRange>
       <tt:YRange>
        <tt:Min>0.0</tt:Min>
        <tt:Max>0.0</tt:Max>
       </tt:YRange>
      </tt:Range>
     </tt:PanTiltLimits>
     <tt:ZoomLimits>
      <tt:Range>
       <tt:URI>http://www.example.com/schema/anyURI</tt:URI>
       <tt:XRange>
        <tt:Min>0.0</tt:Min>
        <tt:Max>0.0</tt:Max>
       </tt:XRange>
      </tt:Range>
     </tt:ZoomLimits>
     <tt:Extension>
      <!-- extensibility element(s) -->
      <tt:PTControlDirection>
       <tt:EFlip>
        <tt:Mode>OFF</tt:Mode>
        <!-- extensibility element(s) -->
       </tt:EFlip>
       <tt:Reverse>
        <tt:Mode>OFF</tt:Mode>
        <!-- extensibility element(s) -->
       </tt:Reverse>
       <tt:Extension>
        <!-- extensibility element(s) -->
       </tt:Extension>
      </tt:PTControlDirection>
      <tt:Extension>
       <!-- extensibility element(s) -->
      </tt:Extension>
     </tt:Extension>
    </tptz:PTZConfiguration>
    <tptz:ForcePersistence>false</tptz:ForcePersistence>
   </tptz:SetConfiguration>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
